---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CopingColumnBeamFailure
source: html/65b98d30-3974-16ca-9cde-7f767fd1406b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CopingColumnBeamFailure Property

The support order for a beam/column connection has been changed. When a beam is supported by a column that same beam cannot be coped by the column. The existing coping has been removed.

## Syntax (C#)
```csharp
public static FailureDefinitionId CopingColumnBeamFailure { get; }
```